{"helptext": "Hey there, I'm Nene, your hostess for this Cheerful Carnival! If you need my help, please use\n— `!info` for my general information\n— `!helpmre` for what commands can be used in the Melt Room Emporium\n— `!helpotheradmin` for how to set your server up to receive my announcements\n— `!helpother` for commands that can be used in other servers\nor\n`!faq` for a list of common questions and answers.\nThank you!",
"infotext":"I'm a bot coded by aren | enragedbicycle and Ai0 from the Melt Room Emporium (https://discord.gg/meltroomemporium)!\nMy purpose is to coordinate Cheerful Shows between MRE's large player base and smaller, dedicated tiering communities that may be struggling to find matches.\nWe do this by broadcasting when MRE players are about to begin a Cheerful Live, what team they're on, and if they're in a General Room or a Pro Room (as well as if those in General Rooms have high BP or not).\nPlease DM `@aren#4309` from MRE if you have any questions that are not answered by our `!help` messsages.",
"helpmretext": "— Check out #nenehostess-instructions and/or #nenehostess-for-rank-climbers!\n— If the countdown is acting wonky, there isn't much we can do!\n— If you can't figure out what `!gen150` is for, you should just use `!gen`.",
"helpadmintext": "Have someone **with administrator permissions* make two new channels and then use /n— `!setchannelx` in one\nand\n— '!setchannely` in the other.\nChannel X will receive notifications from the team on the left side of the in-game CC selection screen, and Channel Y will receive notifications from the team on the right (label them however works best for your community).\nIt is recommended that **at least one administrator:**\n— Joins MRE (<https://discord.gg/meltroomemporium>)\n— Goes to the #resources channel under the `PSEKAI INFO` category\n— Gets the `@NeneHostess PSAs` role in case **an update or emergency happens** that requires you to change settings in your server, reset your X and Y channels, or any commands get added or removed\n— Takes note that Server Rule 11 does not apply to aren when it comes to NeneHostess, so their DMs and the #questions channel can be used for troubleshooting."
"helpothertext": "1) Have one or more members in your party that can see both Discord and PSekai\n> *If you don't have a member that can see both, stop here!*\n2) Make that party member/one of those party members the 'commander'\n3) Join a private room and have everyone but the commander hit 'Ready'\n4)Have your commander hit "Ready" when Nene's message says '[[150K+ BP] General/Pro] Cheerful Live coming up: in 1 seconds!'\n> *the timestamp skips straight from 'in 1 seconds' to '1 seconds ago')*\n5) profit."
"faqtext":"Why isn't Nene more specific about BP?\n > We __firmly__ believe it would be inefficient and more confusing than it's worth; MRE has a very large volume of active players, an extremely varied demographic in terms of BP within that volume, and __often has tiering supporters rotate in and out after only a few rounds and changing the party's BP each time they do!__ Regardless, Nene will **at least** provide a good resource in terms of gauging the opposing team's overall activity when not succeeding in providing immediately matches*\nWill you be making other bots in the future?\n> I intend on making a bot that **can** specify BP for dedicated tiering servers to use between each other after I complete NeneHostess."
}
